SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_can.c
/*****************************************************************************
 * Copyright (c) 2019, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/

/**
*\*\file n32g430_can.C
*\*\author Nations
*\*\version v1.0.0
*\*\copyright Copyright (c) 2019, Nations Technologies Inc. All rights reserved.
**/

#include "n32g430_can.h"
#include "n32g430_rcc.h"

/** CAN Private Defines**/

static INTStatus Interrupt_Status_Check(uint32_t CAN_register, uint32_t initializes_bit);

/** CAN Driving Functions Declaration **/

/**
*\*\name    CAN_Reset
*\*\fun     Deinitializes the CAN peripheral registers to their default reset values.
*\*\param   CANx:
*\*\             - CAN
*\*\return  none
**/
void CAN_Reset(CAN_Module* CANx)
{
    RCC_APB1_Peripheral_Reset(RCC_APB1_PERIPH_CAN);
}

/**
*\*\name    CAN_Sleep_Mode_Exit
*\*\fun     Exit from sleep mode
*\*\param   CANx:
*\*\             - CAN
*\*\return  none
**/
void CAN_Sleep_Mode_Exit(CAN_Module* CANx)  
{
    CANx->MCTRL &= (~(uint32_t)CAN_SLEEP_REQUEST);
}

/**
*\*\name   CAN_Initializes_Enable
*\*\fun    Request initialisation
*\*\param  CANx:
*\*\            - CAN
*\*\return none
**/
void CAN_Initializes_Enable(CAN_Module* CANx)
{
    CANx->MCTRL |= CAN_INIT_REQUEST;
}

/**
*\*\name   CAN_Initializes_Disable
*\*\fun    Request leave initialisation
*\*\param  CANx:
*\*\            - CAN
*\*\return none
**/
void CAN_Initializes_Disable(CAN_Module* CANx)
{
    CANx->MCTRL &= ~(uint32_t)CAN_INIT_REQUEST;
}

/**
*\*\name   CAN_Initializes_Wait
*\*\fun    Wait the acknowledge
*\*\param  CANx:
*\*\            - CAN
*\*\return none
**/
void CAN_Initializes_Wait(CAN_Module* CANx)
{
    uint32_t temp_value  = 0x00000000;          
    while (((CANx->MSTS & CAN_INIT_WAIT) != CAN_INIT_WAIT) && (temp_value != INIAK_TIMEOUT))
    {
        temp_value++;
    }
}

/**
*\*\name   CAN_Initializes_Leave_Wait
*\*\fun    Wait the acknowledge for leave
*\*\param  CANx:
*\*\            - CAN
*\*\return none
**/
void CAN_Initializes_Leave_Wait(CAN_Module* CANx)
{
    uint32_t temp_value  = 0x00000000;
    while (((CANx->MSTS & CAN_INIT_WAIT) == CAN_INIT_WAIT) && (temp_value != INIAK_TIMEOUT))
    {
        temp_value++;
    }
}

/**
*\*\name   CAN_Time_Trigger_Mode_Enable
*\*\fun    Enable the time triggered communication mode
*\*\param  CANx:
*\*\            - CAN
*\*\return none
**/
void CAN_Time_Trigger_Mode_Enable(CAN_Module* CANx)
{
    CANx->MCTRL |= CAN_TIME_TRI_MODE;
}


/**
*\*\name   CAN_Time_Trigger_Mode_Disable
*\*\fun    Disable the time triggered communication mode
*\*\param  CANx:
*\*\            - CAN
*\*\return none
**/
void CAN_Time_Trigger_Mode_Disable(CAN_Module* CANx)
{
    CANx->MCTRL &= ~(uint32_t)CAN_TIME_TRI_MODE;
}

/**
*\*\name   CAN_Bus_Off_Enable
*\*\fun    Enable the automatic bus-off management
*\*\param  CANx:
*\*\            - CAN
*\*\return none
**/
void CAN_Bus_Off_Enable(CAN_Module* CANx)
{
    CANx->MCTRL |= CAN_AUTO_BUS_OFF;
}


/**
*\*\name   CAN_Bus_Off_Disable
*\*\fun    Disable the automatic bus-off management
*\*\param  CANx:
*\*\            - CAN
*\*\return none
**/
void CAN_Bus_Off_Disable(CAN_Module* CANx)
{
    CANx->MCTRL &= ~(uint32_t)CAN_AUTO_BUS_OFF;
}

/**
*\*\name   CAN_Wake_Up_Mode_Enable
*\*\fun    Enable the automatic wake-up mode
*\*\param  CANx:
*\*\            - CAN
*\*\return none
**/
void CAN_Wake_Up_Mode_Enable(CAN_Module* CANx)
{
    CANx->MCTRL |= CAN_AUTO_WAKE_UP;
}

/**
*\*\name   CAN_Wake_Up_Mode_Disable
*\*\fun    Disable the automatic wake-up mode
*\*\param  CANx:
*\*\            - CAN
*\*\return none
**/
void CAN_Wake_Up_Mode_Disable(CAN_Module* CANx)
{
    CANx->MCTRL &= ~(uint32_t)CAN_AUTO_WAKE_UP;
}

/**
*\*\name   CAN_No_Retransmission_Enable
*\*\fun    Enable the no automatic retransmission
*\*\param  CANx:
*\*\            - CAN
*\*\return none
**/
void CAN_No_Retransmission_Enable(CAN_Module* CANx)
{
    CANx->MCTRL |= CAN_AUTO_RETRANS_OFF;
}

/**
*\*\name   CAN_No_Retransmission_Disable
*\*\fun    Set the no automatic retransmission
*\*\param  CANx:
*\*\            - CAN
*\*\return none
**/
void CAN_No_Retransmission_Disable(CAN_Module* CANx)
{
    CANx->MCTRL &= ~(uint32_t)CAN_AUTO_RETRANS_OFF;
}

/**
*\*\name   CAN_DATA_FIFO_Receive_Lock_Enable
*\*\fun    Set the receive DATAFIFO locked mode
*\*\param  CANx:
*\*\            - CAN
*\*\return none
**/
void CAN_DATA_FIFO_Receive_Lock_Enable(CAN_Module* CANx)
{
    CANx->MCTRL |= CAN_RX_FIFO_LOCKED;
}

/**
*\*\name   CAN_DATA_FIFO_Receive_Lock_Disable
*\*\fun    Set the receive DATAFIFO locked mode
*\*\param  CANx:
*\*\            - CAN
*\*\return none
**/
void CAN_DATA_FIFO_Receive_Lock_Disable(CAN_Module* CANx)
{
    CANx->MCTRL &= ~(uint32_t)CAN_RX_FIFO_LOCKED;
}

/**
*\*\name   CAN_DATA_FIFO_Transmit_Priority_Enable
*\*\fun    Enable the transmit DATAFIFO priority 
*\*\param  CANx:
*\*\            - CAN
*\*\return none
**/
void CAN_DATA_FIFO_Transmit_Priority_Enable(CAN_Module* CANx)
{
    CANx->MCTRL |= CAN_TX_FIFO_PRIO;
}

/**
*\*\name   CAN_DATA_FIFO_Transmit_Priority_Disable
*\*\fun    Set the transmit DATAFIFO priority 
*\*\param  CANx:
*\*\            - CAN
*\*\return none
**/
void CAN_DATA_FIFO_Transmit_Priority_Disable(CAN_Module* CANx)
{
    CANx->MCTRL &= ~(uint32_t)CAN_TX_FIFO_PRIO;
}

/**
*\*\name   CAN_Bit_Timing_Set
*\*\fun    Set the bit timing register 
*\*\param  CANx:
*\*\            - CAN
*\*\param  CAN_initializes_parameter :
*\*\            - BaudRatePrescaler
*\*\            - OperatingMode
*\*\            - RSJW
*\*\            - TBS1
*\*\            - TBS2
*\*\return none
**/
void CAN_Bit_Timing_Set(CAN_Module* CANx, CAN_InitType* CAN_initializes_parameter)
{
    CANx->BTIM = (uint32_t)((uint32_t)CAN_initializes_parameter->OperatingMode << CAN_OPERATING_MODE_OFFSET) 
                | ((uint32_t)CAN_initializes_parameter->RSJW << CAN_RSJW_OFFSET)
                | ((uint32_t)CAN_initializes_parameter->TBS1 << CAN_TBS1_OFFSET) 
                | ((uint32_t)CAN_initializes_parameter->TBS2 << CAN_TBS2_OFFSET)
                | ((uint32_t)CAN_initializes_parameter->BaudRatePrescaler - 1);
}

/**
*\*\name   CAN_Initializes
*\*\fun    Initializes the CAN peripheral according to the specified
*\*\       parameters in the CAN_initializes_parameter.
*\*\param  CANx:
*\*\            - CAN
*\*\param  CAN_initializes_parameter :
*\*\            - BaudRatePrescaler
*\*\                - It ranges from 1 to 1024.
*\*\            - OperatingMode
*\*\                - CAN_NORMAL_MODE
*\*\                - CAN_LOOPBACK_MODE
*\*\                - CAN_SILENT_MODE
*\*\                - CAN_SILENT_LOOPBACK_MODE
*\*\            - RSJW
*\*\                - CAN_RSJW_1TQ
*\*\                - CAN_RSJW_2TQ
*\*\                - CAN_RSJW_3TQ
*\*\                - CAN_RSJW_4TQ
*\*\            - TBS1
*\*\                - CAN_TBS1_1TQ
*\*\                - CAN_TBS1_2TQ
*\*\                - CAN_TBS1_3TQ
*\*\                - CAN_TBS1_4TQ
*\*\                - CAN_TBS1_5TQ
*\*\                - CAN_TBS1_6TQ
*\*\                - CAN_TBS1_7TQ
*\*\                - CAN_TBS1_8TQ
*\*\                - CAN_TBS1_9TQ
*\*\                - CAN_TBS1_10TQ
*\*\                - CAN_TBS1_11TQ
*\*\                - CAN_TBS1_12TQ
*\*\                - CAN_TBS1_13TQ
*\*\                - CAN_TBS1_14TQ
*\*\                - CAN_TBS1_15TQ
*\*\                - CAN_TBS1_16TQ
*\*\            - TBS2
*\*\                - CAN_TBS2_1TQ
*\*\                - CAN_TBS2_2TQ
*\*\                - CAN_TBS2_3TQ
*\*\                - CAN_TBS2_4TQ
*\*\                - CAN_TBS2_5TQ
*\*\                - CAN_TBS2_6TQ
*\*\                - CAN_TBS2_7TQ
*\*\                - CAN_TBS2_8TQ
*\*\            - TTCM
*\*\                - DISABLE
*\*\                - ENABLE
*\*\            - ABOM
*\*\                - DISABLE
*\*\                - ENABLE
*\*\            - AWKUM
*\*\                - DISABLE
*\*\                - ENABLE
*\*\            - NART
*\*\                - DISABLE
*\*\                - ENABLE
*\*\            - RFLM
*\*\                - DISABLE
*\*\                - ENABLE
*\*\            - TXFP
*\*\                - DISABLE
*\*\                - ENABLE           
*\*\return CAN_Status :
*\*\            - CAN_STS_Failed
*\*\            - CAN_STS_Success
**/
CAN_Status CAN_Initializes(CAN_Module* CANx, CAN_InitType* CAN_initializes_parameter)
{
    CAN_Sleep_Mode_Exit(CANx);
    CAN_Initializes_Enable(CANx);
    CAN_Initializes_Wait(CANx);

    /* Check acknowledge */
    if ((CANx->MSTS & CAN_INIT_WAIT) != CAN_INIT_WAIT)
    {
        /* At this step, return the status of initialization */
        return CAN_STS_Failed;
    }
    else
    {
        if(CAN_initializes_parameter->TTCM == ENABLE)
        {
            CAN_Time_Trigger_Mode_Enable(CAN);
        }
        else
        {
            CAN_Time_Trigger_Mode_Disable(CAN);
        }
        
        if(CAN_initializes_parameter->ABOM == ENABLE)
        {
            CAN_Bus_Off_Enable(CAN);
        }
        else
        {
            CAN_Bus_Off_Disable(CAN);
        }
        
        if(CAN_initializes_parameter->AWKUM == ENABLE)
        {
            CAN_Wake_Up_Mode_Enable(CAN);
        }
        else
        {
            CAN_Wake_Up_Mode_Disable(CAN);
        }
        
        if(CAN_initializes_parameter->NART == ENABLE)
        {
            CAN_No_Retransmission_Enable(CAN);
        }
        else
        {
            CAN_No_Retransmission_Disable(CAN);
        }
        
        if(CAN_initializes_parameter->RFLM == ENABLE)
        {
            CAN_DATA_FIFO_Receive_Lock_Enable(CANx);
        }
        else
        {
            CAN_DATA_FIFO_Receive_Lock_Disable(CANx);
        }

