SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_can.c
        if(CAN_initializes_parameter->TXFP == ENABLE)
        {
            CAN_DATA_FIFO_Transmit_Priority_Enable(CANx);
        }
        else
        {
            CAN_DATA_FIFO_Transmit_Priority_Disable(CANx);
        }
        CAN_Bit_Timing_Set(CANx,CAN_initializes_parameter);
        CAN_Initializes_Disable(CANx);
        CAN_Initializes_Leave_Wait(CANx);
        /* ...and check acknowledged */
        if ((CANx->MSTS & CAN_INIT_WAIT) == CAN_INIT_WAIT)
        {
            CAN_Initializes_Disable(CANx);
            CAN_Initializes_Leave_Wait(CANx);
            return CAN_STS_Failed;
        }
        else
        {
            return CAN_STS_Success;
        }
    }
}

/**
*\*\name   CAN_Filter_Initializes_Enable
*\*\fun    Initialisation mode for the filter
*\*\param  none
*\*\return none
**/
void CAN_Filter_Initializes_Enable(void)
{
    CAN->FMC |= CAN_FILTER_INIT;
}

/**
*\*\name   CAN_Filter_Initializes_Disable
*\*\fun    Leave the initialisation mode for the filter
*\*\param  none
*\*\return none
**/
void CAN_Filter_Initializes_Disable(void)
{
    CAN->FMC &= ~CAN_FILTER_INIT;
}

/**
*\*\name   CAN_Filter_Deactivation
*\*\fun    Filter Deactivation
*\*\param  filter_position :
*\*\           - It ranges from 2^(0 to 13).
*\*\return none
**/
void CAN_Filter_Deactivation(uint32_t filter_position)
{
    CAN->FA1 &= ~(uint32_t)filter_position;
}

/**
*\*\name   CAN_Filter_Scale_16bit_Set
*\*\fun    Filter 16bitScale check and configure
*\*\param  filter_position :
*\*\            - It ranges from 2^(0 to 13).
*\*\param  CAN_filter_initializes_structure :
*\*\            - Filter_HighId
*\*\            - Filter_LowId
*\*\            - FilterMask_HighId
*\*\            - FilterMask_LowId
*\*\            - Filter_Num
*\*\            - Filter_Scale
*\*\return none
**/
void CAN_Filter_Scale_16bit_Set(CAN_FilterInitType* CAN_filter_initializes_structure, \
                            uint32_t filter_position)
{
    /* Filter Scale */
    if (CAN_filter_initializes_structure->Filter_Scale == CAN_FILTER_16BITSCALE)
    {
        /* 16-bit scale for the filter */
        CAN->FS1 &= ~(uint32_t)filter_position;

        /* First 16-bit identifier and First 16-bit mask */
        /* Or First 16-bit identifier and Second 16-bit identifier */
        CAN->sFilterRegister[CAN_filter_initializes_structure->Filter_Num].FR1 =
            ((0x0000FFFF & (uint32_t)CAN_filter_initializes_structure->FilterMask_LowId) << CAN_FRX_ID_OFFSET)
            | (0x0000FFFF & (uint32_t)CAN_filter_initializes_structure->Filter_LowId);

        /* Second 16-bit identifier and Second 16-bit mask */
        /* Or Third 16-bit identifier and Fourth 16-bit identifier */
        CAN->sFilterRegister[CAN_filter_initializes_structure->Filter_Num].FR2 =
            ((0x0000FFFF & (uint32_t)CAN_filter_initializes_structure->FilterMask_HighId) << CAN_FRX_ID_OFFSET)
            | (0x0000FFFF & (uint32_t)CAN_filter_initializes_structure->Filter_HighId);
    }
    else
    {
        /*No process*/
    }
}

/**
*\*\name   CAN_Filter_Scale_32bit_Set
*\*\fun    Filter 32bitScale check and configure
*\*\param  filter_position :
*\*\            - It ranges from 2^(0 to 13).
*\*\param  CAN_filter_initializes_structure :
*\*\            - Filter_HighId
*\*\            - Filter_LowId
*\*\            - FilterMask_HighId
*\*\            - FilterMask_LowId
*\*\            - Filter_Num
*\*\            - Filter_Scale
*\*\return none
**/
void CAN_Filter_Scale_32bit_Set(CAN_FilterInitType* CAN_filter_initializes_structure, \
                            uint32_t filter_position)
{
    /* Filter Scale */
    if (CAN_filter_initializes_structure->Filter_Scale == CAN_FILTER_32BITSCALE)
    {
        /* 32-bit scale for the filter */
        CAN->FS1 |= filter_position;
        /* 32-bit identifier or First 32-bit identifier */
        CAN->sFilterRegister[CAN_filter_initializes_structure->Filter_Num].FR1 =
            ((0x0000FFFF & (uint32_t)CAN_filter_initializes_structure->Filter_HighId) << CAN_FRX_ID_OFFSET)
            | (0x0000FFFF & (uint32_t)CAN_filter_initializes_structure->Filter_LowId);
        /* 32-bit mask or Second 32-bit identifier */
        CAN->sFilterRegister[CAN_filter_initializes_structure->Filter_Num].FR2 =
            ((0x0000FFFF & (uint32_t)CAN_filter_initializes_structure->FilterMask_HighId) << CAN_FRX_ID_OFFSET)
            | (0x0000FFFF & (uint32_t)CAN_filter_initializes_structure->FilterMask_LowId);
    }
    else
    {
        /*No process*/
    }
}

/**
*\*\name   CAN_Filter_Mode_Set
*\*\fun    Filter Mode configure
*\*\param  filter_mode :
*\*\            - CAN_FILTER_IDMASKMODE
*\*\            - CAN_FILTER_IDLISTMODE
*\*\param  filter_position :
*\*\            - It ranges from 2^(0 to 13).
*\*\return none
**/
void CAN_Filter_Mode_Set(uint8_t filter_mode, uint32_t filter_position)
{
    /* Filter Mode */
    if (filter_mode == CAN_FILTER_IDMASKMODE)
    {
        /*Id/Mask mode for the filter*/
        CAN->FM1 &= ~(uint32_t)filter_position;
    }
    else /* filter_mode == CAN_FILTER_IDLISTMODE */
    {
        /*Identifier list mode for the filter*/
        CAN->FM1 |= (uint32_t)filter_position;
    }
}

/**
*\*\name   CAN_Filter_DATA_FIFO_Assign
*\*\fun    Filter DATAFIFO assignment
*\*\param  filter_position :
*\*\            - It ranges from 2^(0 to 13).
*\*\param  filter_assign :
*\*\            - CAN_FILTER_FIFO0
*\*\            - CAN_FILTER_FIFO1
*\*\return none
**/
void CAN_Filter_DATA_FIFO_Assign(uint16_t filter_assign, uint32_t filter_position)
{
    /* Filter DATAFIFO assignment */
    if (filter_assign == CAN_FILTER_FIFO0)
    {
        /* DATAFIFO 0 assignation for the filter */
        CAN->FFA1 &= ~(uint32_t)filter_position;
    }
    else
    {
        /*No process*/
    }

    if (filter_assign == CAN_FILTER_FIFO1)
    {
        /* DATAFIFO 1 assignation for the filter */
        CAN->FFA1 |= (uint32_t)filter_position;
    }
    else
    {
        /*No process*/
    }
}

/**
*\*\name   CAN_Filter_Activate
*\*\fun    Filter activation
*\*\param  filter_position :
*\*\            - It ranges from 2^(0 to 13).
*\*\return none
**/
void CAN_Filter_Activate(uint32_t filter_position)
{
    CAN->FA1 |= filter_position;
}


/**
*\*\name   CAN_Filter_Initializes
*\*\fun    Initializes the CAN peripheral according to the specified
*\*\       parameters in the CAN_filter_initializes_structure.
*\*\param  CAN_filter_initializes_structure :
*\*\            - Filter_HighId
*\*\                - It ranges from 0x0000 to 0xFFFF
*\*\            - Filter_LowId
*\*\                - It ranges from 0x0000 to 0xFFFF
*\*\            - FilterMask_HighId
*\*\                - It ranges from 0x0000 to 0xFFFF
*\*\            - FilterMask_LowId
*\*\                - It ranges from 0x0000 to 0xFFFF
*\*\            - Filter_FIFOAssignment
*\*\                - CAN_Filter_FIFO0
*\*\                - CAN_Filter_FIFO1
*\*\            - Filter_Num
*\*\                - It ranges from 0 to 13
*\*\            - Filter_Mode
*\*\                - CAN_FILTER_IDMASKMODE
*\*\                - CAN_FILTER_IDLISTMODE
*\*\            - Filter_Scale
*\*\                - CAN_FILTER_16BITSCALE
*\*\                - CAN_FILTER_32BITSCALE
*\*\            - Filter_Act
*\*\                - ENABLE
*\*\                - DISABLE
*\*\return none
**/
void CAN_Filter_Initializes(CAN_FilterInitType* CAN_filter_initializes_structure)
{
    uint32_t filter_position = 0;
    filter_position = ((uint32_t)1) << CAN_filter_initializes_structure->Filter_Num;

    CAN_Filter_Initializes_Enable();
    CAN_Filter_Deactivation(filter_position);
    CAN_Filter_Scale_16bit_Set(CAN_filter_initializes_structure,filter_position);
    CAN_Filter_Scale_32bit_Set(CAN_filter_initializes_structure,filter_position);
    CAN_Filter_Mode_Set(CAN_filter_initializes_structure->Filter_Mode,filter_position);
    CAN_Filter_DATA_FIFO_Assign(CAN_filter_initializes_structure->Filter_FIFOAssignment,\
                                filter_position);
    if (CAN_filter_initializes_structure->Filter_Act == ENABLE)
    {
        CAN_Filter_Activate(filter_position);
    }
    else
    {
        /*No process*/
    }
    CAN_Filter_Initializes_Disable();
}

/**
*\*\name   CAN_Structure_Initializes
*\*\fun    Fills each CAN_initializes_parameter member with its default value.
*\*\param  CAN_initializes_parameter :
*\*\            - BaudRatePrescaler
*\*\            - OperatingMode
*\*\            - RSJW
*\*\            - TBS1
*\*\            - TBS2
*\*\            - TTCM
*\*\            - ABOM
*\*\            - AWKUM
*\*\            - NART
*\*\            - RFLM
*\*\            - TXFP
*\*\return none
**/
void CAN_Structure_Initializes(CAN_InitType* CAN_initializes_parameter)
{
    /* Reset CAN init structure parameters values */

    /* Initialize the time triggered communication mode */
    CAN_initializes_parameter->TTCM = DISABLE;

