SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_can.c
    /* Initialize the automatic bus-off management */
    CAN_initializes_parameter->ABOM = DISABLE;

    /* Initialize the automatic wake-up mode */
    CAN_initializes_parameter->AWKUM = DISABLE;

    /* Initialize the no automatic retransmission */
    CAN_initializes_parameter->NART = DISABLE;

    /* Initialize the receive DATAFIFO locked mode */
    CAN_initializes_parameter->RFLM = DISABLE;

    /* Initialize the transmit DATAFIFO priority */
    CAN_initializes_parameter->TXFP = DISABLE;

    /* Initialize the OperatingMode member */
    CAN_initializes_parameter->OperatingMode = CAN_NORMAL_MODE;

    /* Initialize the RSJW member */
    CAN_initializes_parameter->RSJW = CAN_RSJW_1TQ;

    /* Initialize the TBS1 member */
    CAN_initializes_parameter->TBS1 = CAN_TBS1_4TQ;

    /* Initialize the TBS2 member */
    CAN_initializes_parameter->TBS2 = CAN_TBS2_3TQ;

    /* Initialize the BaudRatePrescaler member */
    CAN_initializes_parameter->BaudRatePrescaler = 1;
}

/**
*\*\name   CAN_Debug_Freeze_Enable
*\*\fun    Enables the DBG Freeze for CAN.
*\*\param  CANx:
*\*\            - CAN
*\*\return none
**/
void CAN_Debug_Freeze_Enable(CAN_Module* CANx)
{
    /* Enable Debug Freeze  */
    CANx->MCTRL |= CAN_DEBUG_FREEZE;    
}


/**
*\*\name   CAN_Debug_Freeze_Disable
*\*\fun    Disables the DBG Freeze for CAN.
*\*\param  CANx:
*\*\            - CAN
*\*\return none
**/
void CAN_Debug_Freeze_Disable(CAN_Module* CANx)
{
    CANx->MCTRL &= ~CAN_DEBUG_FREEZE;
}

/**
*\*\name   CAN_Time_Stamp_Sent_Enable
*\*\fun    Enables the CAN Time stamp sent.
*\*\param  CANx:
*\*\            - CAN
*\*\note   when enabled, Time stamp (TIME[15:0]) value is sent in the last
*\*\       two data bytes of the 8-byte message: TIME[7:0] in data byte 6
*\*\       and TIME[15:8] in data byte 7
*\*\note   DLC must be programmed as 8 in order Time Stamp (2 bytes) to be
*\*\       sent over the CAN bus.
*\*\return none
**/
void CAN_Time_Stamp_Sent_Enable(CAN_Module* CANx)
{
    /* Enable the TTCM mode */
    CANx->MCTRL |= CAN_TIME_TRI_MODE;

    /* Set TGT bits */
    CANx->sTxMailBox[0].TMDT |= ((uint32_t)CAN_TX_GLOBAL_TIME0);
    CANx->sTxMailBox[1].TMDT |= ((uint32_t)CAN_TX_GLOBAL_TIME1);
    CANx->sTxMailBox[2].TMDT |= ((uint32_t)CAN_TX_GLOBAL_TIME2);
}

/**
*\*\name   CAN_Time_Stamp_Sent_Disable
*\*\fun    Enables or disabes the CAN Time TriggerOperation communication mode.
*\*\param  CANx:
*\*\            - CAN
*\*\return none
**/
void CAN_Time_Stamp_Sent_Disable(CAN_Module* CANx)
{
    /* Disable the TTCM mode */
    CANx->MCTRL &= (uint32_t)(~(uint32_t)CAN_TIME_TRI_MODE);

    /* Reset TGT bits */
    CANx->sTxMailBox[0].TMDT &= ((uint32_t)~CAN_TX_GLOBAL_TIME0);
    CANx->sTxMailBox[1].TMDT &= ((uint32_t)~CAN_TX_GLOBAL_TIME1);
    CANx->sTxMailBox[2].TMDT &= ((uint32_t)~CAN_TX_GLOBAL_TIME2);
}


/**
*\*\name   CAN_Transmit_Message_ID_Config
*\*\fun    Set up the Id.
*\*\param  CANx:
*\*\            - CAN
*\*\param  transmit_message :
*\*\            - StdId
*\*\            - ExtId
*\*\            - IDE
*\*\            - RTR
*\*\param  mailbox_queue :
*\*\            - CAN_TXSTS_MAILBOX0
*\*\            - CAN_TXSTS_MAILBOX1
*\*\            - CAN_TXSTS_MAILBOX2
*\*\return none
**/
void CAN_Transmit_Message_ID_Config(CAN_Module* CANx, CanTxMessage* transmit_message, \
                                            uint8_t mailbox_queue)
{
    CANx->sTxMailBox[mailbox_queue].TMI &= CAN_TMIX_TXRQ;
    if (transmit_message->IDE == CAN_STANDARD_ID)
    {
        CANx->sTxMailBox[mailbox_queue].TMI |= ((transmit_message->StdId << CAN_TMI_STDID_OFFSET) | transmit_message->RTR);
    }
    else
    {
        CANx->sTxMailBox[mailbox_queue].TMI |= ((transmit_message->ExtId << CAN_TMI_EXTID_OFFSET) | transmit_message->IDE | transmit_message->RTR);
    }
}

/**
*\*\name   CAN_Transmit_Message_DLC_Config
*\*\fun    Set up the DLC.
*\*\param  CANx:
*\*\            - CAN
*\*\param  data_length
*\*\            - It ranges from 0 to 8
*\*\param  mailbox_queue :
*\*\            - CAN_TXSTS_MAILBOX0
*\*\            - CAN_TXSTS_MAILBOX1
*\*\            - CAN_TXSTS_MAILBOX2
*\*\return none
**/
void CAN_Transmit_Message_DLC_Config(CAN_Module* CANx, uint8_t data_length, \
                                            uint8_t mailbox_queue)
{
    data_length &= (uint8_t)CAN_TMDTx_DLC;
    CANx->sTxMailBox[mailbox_queue].TMDT &= CAN_TMDTx_DLC_MASK;
    CANx->sTxMailBox[mailbox_queue].TMDT |= data_length;
}

/**
*\*\name   CAN_Transmit_Message_Data_Config
*\*\fun    Set up the data field.
*\*\param  CANx:
*\*\            - CAN
*\*\param  transmit_message :
*\*\            - Data[0-7]
*\*\                - It ranges from 0 to 0xFF
*\*\param  mailbox_queue :
*\*\            - CAN_TXSTS_MAILBOX0
*\*\            - CAN_TXSTS_MAILBOX1
*\*\            - CAN_TXSTS_MAILBOX2
*\*\return none
**/
void CAN_Transmit_Message_Data_Config(CAN_Module* CANx, CanTxMessage* transmit_message, \
                                            uint8_t mailbox_queue)
{
    CANx->sTxMailBox[mailbox_queue].TMDL = (((uint32_t)transmit_message->Data[3] << CAN_RMDL_DATA3_OFFSET) 
                                          | ((uint32_t)transmit_message->Data[2] << CAN_RMDL_DATA2_OFFSET)
                                          | ((uint32_t)transmit_message->Data[1] << CAN_RMDL_DATA1_OFFSET) 
                                          | ((uint32_t)transmit_message->Data[0]));
    CANx->sTxMailBox[mailbox_queue].TMDH = (((uint32_t)transmit_message->Data[7] << CAN_RMDH_DATA7_OFFSET) 
                                          | ((uint32_t)transmit_message->Data[6] << CAN_RMDH_DATA6_OFFSET)
                                          | ((uint32_t)transmit_message->Data[5] << CAN_RMDH_DATA5_OFFSET) 
                                          | ((uint32_t)transmit_message->Data[4]));
}

/**
*\*\name   CAN_Transmit_Enable
*\*\fun    Request transmission.
*\*\param  CANx:
*\*\            - CAN
*\*\param  mailbox_queue :
*\*\            - CAN_TXSTS_MAILBOX0
*\*\            - CAN_TXSTS_MAILBOX1
*\*\            - CAN_TXSTS_MAILBOX2
*\*\return none
**/
void CAN_Transmit_Enable(CAN_Module* CANx, uint8_t mailbox_queue)
{
    CANx->sTxMailBox[mailbox_queue].TMI |= CAN_TMIX_TXRQ;
}

/**
*\*\name   CAN_Transmit_Message_initializes
*\*\fun    initialize the transmission of a message.
*\*\param  CANx:
*\*\            - CAN
*\*\param  transmit_message :
*\*\            - StdId
*\*\                - It ranges from 0 to 0x7FF
*\*\            - ExtId
*\*\                - It ranges from 0 to 0x1FFFFFFF
*\*\            - IDE
*\*\                - CAN_STANDARD_ID
*\*\                - CAN_EXTENDED_ID
*\*\            - RTR
*\*\                - CAN_RTRQ_DATA
*\*\                - CAN_RTRQ_REMOTE
*\*\            - DLC
*\*\                - It ranges from 0 to 8
*\*\            - Data[0-7]
*\*\                - It ranges from 0 to 0xFF
*\*\return  mailbox_queue :
*\*\            - CAN_TXSTS_MAILBOX0
*\*\            - CAN_TXSTS_MAILBOX1
*\*\            - CAN_TXSTS_MAILBOX2
*\*\            - CAN_TXSTS_NOMAILBOX
**/
uint8_t CAN_Transmit_Message_initializes(CAN_Module* CANx, CanTxMessage* transmit_message)
{
    uint8_t mailbox_queue = CAN_TXSTS_MAILBOX0;

