SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_can.c
    /* Select one empty transmit mailbox */
    if ((CANx->TSTS & CAN_TX_MAILBOX_EMPTY0) == CAN_TX_MAILBOX_EMPTY0)
    {
        mailbox_queue = CAN_TXSTS_MAILBOX0;
    }
    else if ((CANx->TSTS & CAN_TX_MAILBOX_EMPTY1) == CAN_TX_MAILBOX_EMPTY1)
    {
        mailbox_queue = CAN_TXSTS_MAILBOX1;
    }
    else if ((CANx->TSTS & CAN_TX_MAILBOX_EMPTY2) == CAN_TX_MAILBOX_EMPTY2)
    {
        mailbox_queue = CAN_TXSTS_MAILBOX2;
    }
    else
    {
        mailbox_queue = CAN_TXSTS_NOMAILBOX;
    }

    if (mailbox_queue != CAN_TXSTS_NOMAILBOX)
    {
        /* Set up the Id */
        CAN_Transmit_Message_ID_Config(CANx,transmit_message,mailbox_queue);
        /* Set up the DLC */
        CAN_Transmit_Message_DLC_Config(CANx,transmit_message->DLC,mailbox_queue);
        /* Set up the data field */
        CAN_Transmit_Message_Data_Config(CANx,transmit_message,mailbox_queue);
        /* Request transmission */
        CAN_Transmit_Enable(CANx,mailbox_queue);
    }
    else
    {
        /*No process*/
    }

    return mailbox_queue;
}

/**
*\*\name   CAN_Transmit_Status_Get
*\*\fun    Checks the transmission of a message.
*\*\param  CANx:
*\*\            - CAN
*\*\param  mailbox_queue :
*\*\            - CAN_TXSTS_MAILBOX0
*\*\            - CAN_TXSTS_MAILBOX1
*\*\            - CAN_TXSTS_MAILBOX2
*\*\return CAN_Tx_Status :
*\*\            - CAN_TXSTS_FAILED
*\*\            - CAN_TXSTS_OK
*\*\            - CAN_TXSTS_PENDING
**/
CAN_Tx_Status CAN_Transmit_Status_Get(CAN_Module* CANx, uint8_t mailbox_queue)
{
    uint32_t status_value = CAN_TXSTS_FAILED;

    switch (mailbox_queue)
    {
        case (CAN_TXSTS_MAILBOX0):
            status_value = CANx->TSTS & (CAN_MAILBOX0_RQ_OK | CAN_MAILBOX0_TX_OK | CAN_TX_MAILBOX_EMPTY0);
            break;
        case (CAN_TXSTS_MAILBOX1):
            status_value = CANx->TSTS & (CAN_MAILBOX1_RQ_OK | CAN_MAILBOX1_TX_OK | CAN_TX_MAILBOX_EMPTY1);
            break;
        case (CAN_TXSTS_MAILBOX2):
            status_value = CANx->TSTS & (CAN_MAILBOX2_RQ_OK | CAN_MAILBOX2_TX_OK | CAN_TX_MAILBOX_EMPTY2);
            break;
        default:
            status_value = CAN_TXSTS_FAILED;
            break;
    }
    switch (status_value)
    {
        /* transmit pending  */
        case (0x0):
            status_value = CAN_TXSTS_PENDING;
            break;
            /* transmit failed  */
        case (CAN_MAILBOX0_RQ_OK | CAN_TX_MAILBOX_EMPTY0):
            status_value = CAN_TXSTS_FAILED;
            break;
        case (CAN_MAILBOX1_RQ_OK | CAN_TX_MAILBOX_EMPTY1):
            status_value = CAN_TXSTS_FAILED;
            break;
        case (CAN_MAILBOX2_RQ_OK | CAN_TX_MAILBOX_EMPTY2):
            status_value = CAN_TXSTS_FAILED;
            break;
            /* transmit succeeded  */
        case (CAN_MAILBOX0_RQ_OK | CAN_MAILBOX0_TX_OK | CAN_TX_MAILBOX_EMPTY0):
            status_value = CAN_TXSTS_OK;
            break;
        case (CAN_MAILBOX1_RQ_OK | CAN_MAILBOX1_TX_OK | CAN_TX_MAILBOX_EMPTY1):
            status_value = CAN_TXSTS_OK;
            break;
        case (CAN_MAILBOX2_RQ_OK | CAN_MAILBOX2_TX_OK | CAN_TX_MAILBOX_EMPTY2):
            status_value = CAN_TXSTS_OK;
            break;
        default:
            status_value = CAN_TXSTS_FAILED;
            break;
    }
    return (CAN_Tx_Status)status_value;
}

/**
*\*\name   CAN_Transmit_Message_Cancel
*\*\brief  Cancels a transmit request.
*\*\param  CANx:
*\*\            - CAN
*\*\param  mailbox_queue :
*\*\            - CAN_TXSTS_MAILBOX0
*\*\            - CAN_TXSTS_MAILBOX1
*\*\            - CAN_TXSTS_MAILBOX2
*\*\return none
**/
void CAN_Transmit_Message_Cancel(CAN_Module* CANx, uint8_t mailbox_queue) 
{
    /* abort transmission */
    switch (mailbox_queue)
    {
        case (CAN_TXSTS_MAILBOX0):
            CANx->TSTS = CAN_MAILBOX0_RQ_AB;
            break;
        case (CAN_TXSTS_MAILBOX1):
            CANx->TSTS = CAN_MAILBOX1_RQ_AB;
            break;
        case (CAN_TXSTS_MAILBOX2):
            CANx->TSTS = CAN_MAILBOX2_RQ_AB;
            break;
        default:
            break;
    }
}

/**
*\*\name   CAN_Message_Receive
*\*\fun    Receives a message.
*\*\param  CANx:
*\*\            - CAN
*\*\param  FIFO_number :
*\*\            - CAN_FIFO0
*\*\            - CAN_FIFO1
*\*\param  receive_message :
*\*\            - StdId
*\*\                - It ranges from 0 to 0x7FF
*\*\            - ExtId
*\*\                - It ranges from 0 to 0x1FFFFFFF
*\*\            - IDE
*\*\                - CAN_STANDARD_ID
*\*\                - CAN_EXTENDED_ID
*\*\            - RTR
*\*\                - CAN_RTRQ_DATA
*\*\                - CAN_RTRQ_REMOTE
*\*\            - DLC
*\*\                - It ranges from 0 to 8
*\*\            - Data[0-7]
*\*\                - It ranges from 0 to 0xFF
*\*\            - FMI
*\*\                - It ranges from 0 to 0xFF
*\*\return none
**/
void CAN_Message_Receive(CAN_Module* CANx, uint8_t FIFO_number, CanRxMessage* receive_message)
{
    /* Get the Id */
    receive_message->IDE = (uint8_t)CAN_RMIx_IDE & CANx->sFIFOMailBox[FIFO_number].RMI;
    if (receive_message->IDE == CAN_STANDARD_ID)
    {
        receive_message->StdId = (CAN_RMIx_STDID & CANx->sFIFOMailBox[FIFO_number].RMI) >> CAN_RMI_STDID_OFFSET;
    }
    else
    {
        receive_message->ExtId = (CAN_EXTID_MASK & CANx->sFIFOMailBox[FIFO_number].RMI) >> CAN_RMI_EXTID_OFFSET;
    }

    receive_message->RTR = (uint8_t)CAN_RMIx_RTRQ & CANx->sFIFOMailBox[FIFO_number].RMI;
    /* Get the DLC */
    receive_message->DLC = (uint8_t)CAN_TMDTx_DLC & CANx->sFIFOMailBox[FIFO_number].RMDT;
    /* Get the FMI */
    receive_message->FMI = (uint8_t)CAN_DATA_FIFO_MASK & (CANx->sFIFOMailBox[FIFO_number].RMDT >> CAN_RMDT_OFFSET);
    /* Get the data field */
    receive_message->Data[0] = (uint8_t)CAN_DATA_FIFO_MASK & CANx->sFIFOMailBox[FIFO_number].RMDL;
    receive_message->Data[1] = (uint8_t)CAN_DATA_FIFO_MASK & (CANx->sFIFOMailBox[FIFO_number].RMDL >> CAN_RMDL_DATA1_OFFSET);
    receive_message->Data[2] = (uint8_t)CAN_DATA_FIFO_MASK & (CANx->sFIFOMailBox[FIFO_number].RMDL >> CAN_RMDL_DATA2_OFFSET);
    receive_message->Data[3] = (uint8_t)CAN_DATA_FIFO_MASK & (CANx->sFIFOMailBox[FIFO_number].RMDL >> CAN_RMDL_DATA3_OFFSET);
    receive_message->Data[4] = (uint8_t)CAN_DATA_FIFO_MASK & CANx->sFIFOMailBox[FIFO_number].RMDH;
    receive_message->Data[5] = (uint8_t)CAN_DATA_FIFO_MASK & (CANx->sFIFOMailBox[FIFO_number].RMDH >> CAN_RMDH_DATA5_OFFSET);
    receive_message->Data[6] = (uint8_t)CAN_DATA_FIFO_MASK & (CANx->sFIFOMailBox[FIFO_number].RMDH >> CAN_RMDH_DATA6_OFFSET);
    receive_message->Data[7] = (uint8_t)CAN_DATA_FIFO_MASK & (CANx->sFIFOMailBox[FIFO_number].RMDH >> CAN_RMDH_DATA7_OFFSET);
    /* Release the DATAFIFO */
    /* Release FIFO0 */
    if (FIFO_number == CAN_FIFO0)
    {
        CANx->RFF0 |= CAN_RELEASE_FIFO_0;
    }
    /* Release FIFO1 */
    else /* FIFO_number == CAN_FIFO1 */
    {
        CANx->RFF1 |= CAN_RELEASE_FIFO_1;
    }
}

/**
*\*\name   CAN_FIFO_Release
*\*\fun    Releases the specified DATAFIFO.
*\*\param  CANx:
*\*\            - CAN
*\*\param  FIFO_number :
*\*\            - CAN_FIFO0
*\*\            - CAN_FIFO1
*\*\return none
**/
void CAN_FIFO_Release(CAN_Module* CANx, uint8_t FIFO_number)
{
    /* Release FIFO0 */
    if (FIFO_number == CAN_FIFO0)
    {
        CANx->RFF0 |= CAN_RELEASE_FIFO_0;
    }
    /* Release FIFO1 */
    else /* FIFO_number == CAN_FIFO1 */
    {
        CANx->RFF1 |= CAN_RELEASE_FIFO_1;
    }
}

/**
*\*\name   CAN_Message_Pending_Get
*\*\fun    Returns the number of pending messages.
*\*\param  CANx :
*\*\            - CAN
*\*\param  FIFO_number :
*\*\            - CAN_FIFO0
*\*\            - CAN_FIFO1
*\*\return pending_value : 
*\*\            - CAN_FIFOX_PENDING_0
*\*\            - CAN_FIFOX_PENDING_1
*\*\            - CAN_FIFOX_PENDING_2
*\*\            - CAN_FIFOX_PENDING_3
**/
uint8_t CAN_Message_Pending_Get(CAN_Module* CANx, uint8_t FIFO_number)
{
    uint8_t pending_value = CAN_FIFOX_PENDING_0;
    if (FIFO_number == CAN_FIFO0)
    {
        pending_value = (uint8_t)(CANx->RFF0 & CAN_FIFO0_PENDING);
    }
    else if (FIFO_number == CAN_FIFO1)
    {
        pending_value = (uint8_t)(CANx->RFF1 & CAN_FIFO1_PENDING);
    }
    else
    {
        pending_value = CAN_FIFOX_PENDING_0;
    }
    return pending_value;
}

/**
*\*\name   CAN_Operating_Mode_Select
*\*\fun    Select the CAN Operation mode.
*\*\param  CANx:
*\*\            - CAN
*\*\param  CAN_OperatingMode :
*\*\               - CAN_OPERATING_INITMODE
*\*\               - CAN_OPERATING_NORMALMODE
*\*\               - CAN_OPERATING_SLEEPMODE
*\*\return status_value :
*\*\               - CAN_STS_Failed    CAN failed entering the specific mode
*\*\               - CAN_STS_Success   CAN Succeed entering the specific mode
**/
CAN_Status CAN_Operating_Mode_Select(CAN_Module* CANx, uint8_t CAN_operating_mode)
{
    CAN_Status status_value = CAN_STS_Failed;

    /* Timeout for INAK or also for SLAK bits*/
    uint32_t timeout_value = INIAK_TIMEOUT;

    if (CAN_operating_mode == CAN_OPERATING_INITMODE)
    {
        /* Request initialisation */
        CANx->MCTRL = (uint32_t)((CANx->MCTRL & (uint32_t)(~(uint32_t)CAN_SLEEP_REQUEST)) | CAN_INIT_REQUEST);

        /* Wait the acknowledge */
        while (((CANx->MSTS & CAN_MODE_MASK) != CAN_INIT_WAIT) && (timeout_value != 0))
        {
            timeout_value--;
        }
        if ((CANx->MSTS & CAN_MODE_MASK) != CAN_INIT_WAIT)
        {
            status_value = CAN_STS_Failed;
        }
        else
        {
            status_value = CAN_STS_Success;
        }
    }
    else if (CAN_operating_mode == CAN_OPERATING_NORMALMODE)
    {
        /* Request leave initialisation and sleep mode  and enter Normal mode */
        CANx->MCTRL &= (uint32_t)(~(CAN_SLEEP_REQUEST | CAN_INIT_REQUEST));

        /* Wait the acknowledge */
        while (((CANx->MSTS & CAN_MODE_MASK) != RESET) && (timeout_value != 0))
        {
            timeout_value--;
        }

        if ((CANx->MSTS & CAN_MODE_MASK) != RESET)
        {
            status_value = CAN_STS_Failed;
        }
        else
        {
            status_value = CAN_STS_Success;
        }
    }
    else if (CAN_operating_mode == CAN_OPERATING_SLEEPMODE)
    {
        /* Request Sleep mode */
        CANx->MCTRL = (uint32_t)((CANx->MCTRL & (uint32_t)(~(uint32_t)CAN_INIT_REQUEST)) | CAN_SLEEP_REQUEST);

        /* Wait the acknowledge */
        while (((CANx->MSTS & CAN_MODE_MASK) != CAN_SLEEP_WAIT) && (timeout_value != 0))
        {
            timeout_value--;
        }
        if ((CANx->MSTS & CAN_MODE_MASK) != CAN_SLEEP_WAIT)
        {
            status_value = CAN_STS_Failed;
        }
        else
        {
            status_value = CAN_STS_Success;
        }
    }
    else
    {
        status_value = CAN_STS_Failed;
    }

    return status_value;
}

/**
*\*\name   CAN_Sleep_Mode_Enter
*\*\fun    Enters the low power mode.
*\*\param  CANx:
*\*\            - CAN
*\*\return CAN_Status: 
*\*\            - CAN_STS_Success
*\*\            - CAN_STS_Failed
**/
CAN_Status CAN_Sleep_Mode_Enter(CAN_Module* CANx) 
{
    /* Request Sleep mode */
    CANx->MCTRL = (((CANx->MCTRL) & (uint32_t)(~(uint32_t)CAN_INIT_REQUEST)) | CAN_SLEEP_REQUEST);

    /* Sleep mode status */
    if ((CANx->MSTS & CAN_MODE_MASK) == CAN_SLEEP_WAIT)
    {
        /* Sleep mode entered */
        return CAN_STS_Success;
    }
    else
    {
        /* Sleep mode not entered */
        return CAN_STS_Failed;
    }
}

/**
*\*\name   CAN_Wake_Up_Enable
*\*\fun    Wakes the CAN up.
*\*\param  CANx:
*\*\            - CAN
*\*\return CAN_Status: 
*\*\            - CAN_STS_Success
*\*\            - CAN_STS_Failed
**/
CAN_Status CAN_Wake_Up_Enable(CAN_Module* CANx)
{
    uint32_t timeout_value   = SLPAK_TIMEOUT;

    /* Wake up request */
    CANx->MCTRL &= ~(uint32_t)CAN_SLEEP_REQUEST;

    /* Sleep mode status */
    while (((CANx->MSTS & CAN_SLEEP_WAIT) == CAN_SLEEP_WAIT) && (timeout_value != 0x00))
    {
        timeout_value--;
    }
    if ((CANx->MSTS & CAN_SLEEP_WAIT) != CAN_SLEEP_WAIT)
    {
        /* wake up done : Sleep mode exited */
        return CAN_STS_Success;
    }
    else
    {
        return CAN_STS_Failed;
    }
}

/**
*\*\name   CAN_Last_Error_Code_Get
*\*\fun    Returns the CANx's last error code (LEC).
*\*\param  CANx:
*\*\            - CAN
*\*\return error_code_value :
*\*\            - CAN_ERRORCODE_NOERR            No Error
*\*\            - CAN_ERRORCODE_STUFFERR         Stuff Error
*\*\            - CAN_ERRORCODE_FORMERR          Form Error
*\*\            - CAN_ERRORCODE_ACKERR           Acknowledgment Error
*\*\            - CAN_ERRORCODE_BITRECESSIVEERR  Bit Recessive Error
*\*\            - CAN_ERRORCODE_BITDOMINANTERR   Bit Dominant Error
*\*\            - CAN_ERRORCODE_CRCERR           CRC Error
*\*\            - CAN_ERRORCODE_SWSETERR         Software Set Error
**/
uint8_t CAN_Last_Error_Code_Get(CAN_Module* CANx)
{
    uint8_t error_code_value = 0;

    /* Get the error code*/
    error_code_value = (((uint8_t)CANx->ESTS) & (uint8_t)CAN_ERRORCODE_SWSETERR);

    /* Return the error code*/
    return error_code_value;
}

/**
*\*\name   CAN_Receive_Error_Counter_Get
*\*\fun    Returns the CANx Receive Error Counter (REC).
*\*\note   In case of an error during reception, this counter is incremented
*\*\       by 1 or by 8 depending on the error condition as defined by the CAN
*\*\       standard. After every successful reception, the counter is
*\*\       decremented by 1 or reset to 120 if its value was higher than 128.
*\*\       When the counter value exceeds 127, the CAN controller enters the
*\*\       error passive state.
*\*\param  CANx:
*\*\            - CAN
*\*\return counter_value:
*\*\            - It ranges from 0 to 127
**/
uint8_t CAN_Receive_Error_Counter_Get(CAN_Module* CANx)
{
    uint8_t counter_value = 0;

    /* Get the Receive Error Counter*/
    counter_value = (uint8_t)((CANx->ESTS & CAN_RX_ERROR_COUNT) >> CAN_ESTS_RX_ERROR_OFFSET);

