SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_can.c
    /* Return the Receive Error Counter*/
    return counter_value;
}

/**
*\*\name   CAN_LSB_Transmit_Error_Counter_Get
*\*\fun    Returns the LSB of the 9-bit CANx Transmit Error Counter(TEC).
*\*\param  CAN to to select the CAN peripheral.
*\*\return counter_value:
*\*\            - It ranges from 0 to 127
**/
uint8_t CAN_LSB_Transmit_Error_Counter_Get(CAN_Module* CANx)
{
    uint8_t counter_value = 0;

    /* Get the LSB of the 9-bit CANx Transmit Error Counter(TEC) */
    counter_value = (uint8_t)((CANx->ESTS & CAN_TX_ERROR_COUNT) >> CAN_ESTS_TX_ERROR_OFFSET);

    /* Return the LSB of the 9-bit CANx Transmit Error Counter(TEC) */
    return counter_value;
}

/**
*\*\name   CAN_Config_Interrupt_Enable
*\*\fun    Enables the specified CANx interrupts.
*\*\param  CANx:
*\*\               - CAN
*\*\param  CAN_interrupt :
*\*\               - CAN_INT_TME,
*\*\               - CAN_INT_FMP0,
*\*\               - CAN_INT_FF0,
*\*\               - CAN_INT_FOV0,
*\*\               - CAN_INT_FMP1,
*\*\               - CAN_INT_FF1,
*\*\               - CAN_INT_FOV1,
*\*\               - CAN_INT_EWG,
*\*\               - CAN_INT_EPV,
*\*\               - CAN_INT_BOF,
*\*\               - CAN_INT_LEC,
*\*\               - CAN_INT_ERR,
*\*\               - CAN_INT_WKU,
*\*\               - CAN_INT_SLK.
*\*\return none
**/
void CAN_Config_Interrupt_Enable(CAN_Module* CANx, uint32_t CAN_interrupt)
{
    /* Enable the selected CANx interrupt */
    CANx->INTE |= CAN_interrupt;
}

/**
*\*\name   CAN_Config_Interrupt_Disable
*\*\fun    Disables the specified CANx interrupts.
*\*\param  CANx:
*\*\               - CAN
*\*\param  CAN_interrupt :
*\*\               - CAN_INT_TME,
*\*\               - CAN_INT_FMP0,
*\*\               - CAN_INT_FF0,
*\*\               - CAN_INT_FOV0,
*\*\               - CAN_INT_FMP1,
*\*\               - CAN_INT_FF1,
*\*\               - CAN_INT_FOV1,
*\*\               - CAN_INT_EWG,
*\*\               - CAN_INT_EPV,
*\*\               - CAN_INT_BOF,
*\*\               - CAN_INT_LEC,
*\*\               - CAN_INT_ERR,
*\*\               - CAN_INT_WKU,
*\*\               - CAN_INT_SLK.
*\*\return none
**/
void CAN_Config_Interrupt_Disable(CAN_Module* CANx, uint32_t CAN_interrupt)
{
    /* Disable the selected CANx interrupt */
    CANx->INTE &= ~CAN_interrupt;
}



/**
*\*\name   CAN_Flag_status_Get
*\*\fun    Checks whether the specified CAN flag is set or not.
*\*\param  CANx:
*\*\                - CAN
*\*\param  CAN_flag :
*\*\                - CAN_FLAG_EWGFL
*\*\                - CAN_FLAG_EPVFL
*\*\                - CAN_FLAG_BOFFL
*\*\                - CAN_FLAG_LEC
*\*\                - CAN_FLAG_RQCPM0
*\*\                - CAN_FLAG_RQCPM1
*\*\                - CAN_FLAG_RQCPM2
*\*\                - CAN_FLAG_FFMP1
*\*\                - CAN_FLAG_FFULL1
*\*\                - CAN_FLAG_FFOVR1
*\*\                - CAN_FLAG_FFMP0
*\*\                - CAN_FLAG_FFULL0
*\*\                - CAN_FLAG_FFOVR0
*\*\                - CAN_FLAG_WKU
*\*\                - CAN_FLAG_SLAK
*\*\return  FlagStatus:
*\*\                - SET
*\*\                - RESET
**/
FlagStatus CAN_Flag_status_Get(CAN_Module* CANx, uint32_t CAN_flag)
{
    if ((CAN_flag & CAN_FLAGS_ESTS) != (uint32_t)RESET)
    {
        /* Check the status of the specified CAN flag */
        if ((CANx->ESTS & (CAN_flag & CAN_FLAG_MASK)) != (uint32_t)RESET)
        {
            /* CAN_flag is set */
            return SET;
        }
        else
        {
            /* CAN_flag is reset */
            return RESET;
        }
    }
    else if ((CAN_flag & CAN_FLAGS_MSTS) != (uint32_t)RESET)
    {
        /* Check the status of the specified CAN flag */
        if ((CANx->MSTS & (CAN_flag & CAN_FLAG_MASK)) != (uint32_t)RESET)
        {
            /* CAN_flag is set */
            return SET;
        }
        else
        {
            /* CAN_flag is reset */
            return RESET;
        }
    }
    else if ((CAN_flag & CAN_FLAGS_TSTS) != (uint32_t)RESET)
    {
        /* Check the status of the specified CAN flag */
        if ((CANx->TSTS & (CAN_flag & CAN_FLAG_MASK)) != (uint32_t)RESET)
        {
            /* CAN_flag is set */
            return SET;
        }
        else
        {
            /* CAN_flag is reset */
            return RESET;
        }
    }
    else if ((CAN_flag & CAN_FLAGS_RFF0) != (uint32_t)RESET)
    {
        /* Check the status of the specified CAN flag */
        if ((CANx->RFF0 & (CAN_flag & CAN_FLAG_MASK)) != (uint32_t)RESET)
        {
            /* CAN_flag is set */
            return SET;
        }
        else
        {
            /* CAN_flag is reset */
            return RESET;
        }
    }
    else /* If(CAN_flag & CAN_FLAGS_RFF1 != (uint32_t)RESET) */
    {
        /* Check the status of the specified CAN flag */
        if ((uint32_t)(CANx->RFF1 & (CAN_flag & CAN_FLAG_MASK)) != (uint32_t)RESET)
        {
            /* CAN_flag is set */
            return SET;
        }
        else
        {
            /* CAN_flag is reset */
            return RESET;
        }
    }
}

/**
*\*\name   CAN_Flag_Status_Clear
*\*\fun    Clears the CAN's flag status.
*\*\param  CANx:
*\*\                  - CAN
*\*\param  CAN_flag :
*\*\                  - CAN_FLAG_RQCPM0
*\*\                  - CAN_FLAG_RQCPM1
*\*\                  - CAN_FLAG_RQCPM2
*\*\                  - CAN_FLAG_FFULL1
*\*\                  - CAN_FLAG_FFOVR1
*\*\                  - CAN_FLAG_FFULL0
*\*\                  - CAN_FLAG_FFOVR0
*\*\                  - CAN_FLAG_WKU
*\*\                  - CAN_FLAG_SLAK
*\*\                  - CAN_FLAG_LEC
*\*\return none
**/
void CAN_Flag_Status_Clear(CAN_Module* CANx, uint32_t CAN_flag)
{
    uint32_t temp_value = 0;

    if (CAN_flag == CAN_FLAG_LEC) /* ESTS register */
    {
        /* Clear the selected CAN flags */
        CANx->ESTS = (uint32_t)RESET;
    }
    else /* MSTS or TSTS or RFF0 or RFF1 */
    {
        temp_value = CAN_flag & CAN_FLAG_MASK;

        if ((CAN_flag & CAN_FLAGS_RFF0) != (uint32_t)RESET)
        {
            /* Receive Flags */
            CANx->RFF0 = (uint32_t)(temp_value);
        }
        else if ((CAN_flag & CAN_FLAGS_RFF1) != (uint32_t)RESET)
        {
            /* Receive Flags */
            CANx->RFF1 = (uint32_t)(temp_value);
        }
        else if ((CAN_flag & CAN_FLAGS_TSTS) != (uint32_t)RESET)
        {
            /* Transmit Flags */
            CANx->TSTS = (uint32_t)(temp_value);
        }
        else /* If((CAN_flag & CAN_FLAGS_MSTS)!=(uint32_t)RESET) */
        {
            /* Operating mode Flags */
            CANx->MSTS = (uint32_t)(temp_value);
        }
    }
}

/**
*\*\name   CAN_Interrupt_Status_Get
*\*\fun    Checks whether the specified CANx interrupt has occurred or not.
*\*\param  CANx:
*\*\                    -  CAN
*\*\param  CAN_interrupt :
*\*\                    -  CAN_INT_TME
*\*\                    -  CAN_INT_FMP0
*\*\                    -  CAN_INT_FF0
*\*\                    -  CAN_INT_FOV0
*\*\                    -  CAN_INT_FMP1
*\*\                    -  CAN_INT_FF1
*\*\                    -  CAN_INT_FOV1
*\*\                    -  CAN_INT_WKU
*\*\                    -  CAN_INT_SLK
*\*\                    -  CAN_INT_EWG
*\*\                    -  CAN_INT_EPV
*\*\                    -  CAN_INT_BOF
*\*\                    -  CAN_INT_LEC
*\*\                    -  CAN_INT_ERR
*\*\return INTStatus : 
*\*\                    - SET
*\*\                    - RESET
**/
INTStatus CAN_Interrupt_Status_Get(CAN_Module* CANx, uint32_t CAN_interrupt)
{
    INTStatus status_value = RESET;
    /* check the enable interrupt bit */
    if ((CANx->INTE & CAN_interrupt) != RESET)
    {
        /* in case the Interrupt is enabled, .... */
        switch (CAN_interrupt)
        {
            case CAN_INT_TME:
                /* Check CAN_TSTS_RQCPx bits */
                status_value = Interrupt_Status_Check(CANx->TSTS, CAN_MAILBOX0_RQ_OK | CAN_MAILBOX1_RQ_OK | CAN_MAILBOX2_RQ_OK);
                break;
            case CAN_INT_FMP0:
                /* Check CAN_RFF0_FFMP0 bit */
                status_value = Interrupt_Status_Check(CANx->RFF0, CAN_FIFO0_PENDING);
                break;
            case CAN_INT_FF0:
                /* Check CAN_RFF0_FFULL0 bit */
                status_value = Interrupt_Status_Check(CANx->RFF0, CAN_FULL_FIFO_0);
                break;
            case CAN_INT_FOV0:
                /* Check CAN_RFF0_FFOVR0 bit */
                status_value = Interrupt_Status_Check(CANx->RFF0, CAN_OVER_FIFO_0);
                break;
            case CAN_INT_FMP1:
                /* Check CAN_RFF1_FFMP1 bit */
                status_value = Interrupt_Status_Check(CANx->RFF1, CAN_FIFO1_PENDING);
                break;
            case CAN_INT_FF1:
                /* Check CAN_RFF1_FFULL1 bit */
                status_value = Interrupt_Status_Check(CANx->RFF1, CAN_FULL_FIFO_1);
                break;
            case CAN_INT_FOV1:
                /* Check CAN_RFF1_FFOVR1 bit */
                status_value = Interrupt_Status_Check(CANx->RFF1, CAN_OVER_FIFO_1);
                break;
            case CAN_INT_WKU:
                /* Check CAN_MSTS_WKUINT bit */
                status_value = Interrupt_Status_Check(CANx->MSTS, CAN_WAKE_UP_INT);
                break;
            case CAN_INT_SLK:
                /* Check CAN_MSTS_SLAKINT bit */
                status_value = Interrupt_Status_Check(CANx->MSTS, CAN_SLEEP_WAITINT);
                break;
            case CAN_INT_EWG:
                /* Check CAN_ESTS_EWGFL bit */
                status_value = Interrupt_Status_Check(CANx->ESTS, CAN_ERROR_WARN_FLAG);
                break;
            case CAN_INT_EPV:
                /* Check CAN_ESTS_EPVFL bit */
                status_value = Interrupt_Status_Check(CANx->ESTS, CAN_ERROR_PASS_FLAG);
                break;
            case CAN_INT_BOF:
                /* Check CAN_ESTS_BOFFL bit */
                status_value = Interrupt_Status_Check(CANx->ESTS, CAN_BUS_OFF_FLAG);
                break;
            case CAN_INT_LEC:
                /* Check CAN_ESTS_LEC bit */
                status_value = Interrupt_Status_Check(CANx->ESTS, CAN_ERRORCODE_SWSETERR);
                break;
            case CAN_INT_ERR:
                /* Check CAN_MSTS_ERRINT bit */
                status_value = Interrupt_Status_Check(CANx->MSTS, CAN_ERROR_INT);
                break;
            default:
                /* in case of error, return RESET */
                status_value = RESET;
                break;
        }
    }
    else
    {
        /* in case the Interrupt is not enabled, return RESET */
        status_value = RESET;
    }

    /* Return the CAN_interrupt status */
    return status_value;
}

/**
*\*\name   CAN_Interrupt_Status_Clear
*\*\fun    Clears the CANx's interrupt status.
*\*\param  CANx:
*\*\                -  CAN
*\*\param  CAN_interrupt :
*\*\                -  CAN_INT_TME
*\*\                -  CAN_INT_FF0
*\*\                -  CAN_INT_FOV0
*\*\                -  CAN_INT_FF1
*\*\                -  CAN_INT_FOV1
*\*\                -  CAN_INT_WKU
*\*\                -  CAN_INT_SLK
*\*\                -  CAN_INT_EWG
*\*\                -  CAN_INT_EPV
*\*\                -  CAN_INT_BOF
*\*\                -  CAN_INT_LEC
*\*\                -  CAN_INT_ERR
*\*\return none
**/
void CAN_Interrupt_Status_Clear(CAN_Module* CANx, uint32_t CAN_interrupt)
{
    switch (CAN_interrupt)
    {
    case CAN_INT_TME:
        /* Clear CAN_TSTS_RQCPx (rc_w1)*/
        CANx->TSTS = CAN_MAILBOX0_RQ_OK | CAN_MAILBOX1_RQ_OK | CAN_MAILBOX2_RQ_OK;
        break;
    case CAN_INT_FF0:
        /* Clear CAN_RFF0_FFULL0 (rc_w1)*/
        CANx->RFF0 = CAN_FULL_FIFO_0;
        break;
    case CAN_INT_FOV0:
        /* Clear CAN_RFF0_FFOVR0 (rc_w1)*/
        CANx->RFF0 = CAN_OVER_FIFO_0;
        break;
    case CAN_INT_FF1:
        /* Clear CAN_RFF1_FFULL1 (rc_w1)*/
        CANx->RFF1 = CAN_FULL_FIFO_1;
        break;
    case CAN_INT_FOV1:
        /* Clear CAN_RFF1_FFOVR1 (rc_w1)*/
        CANx->RFF1 = CAN_OVER_FIFO_1;
        break;
    case CAN_INT_WKU:
        /* Clear CAN_MSTS_WKUINT (rc_w1)*/
        CANx->MSTS = CAN_WAKE_UP_INT;
        break;
    case CAN_INT_SLK:
        /* Clear CAN_MSTS_SLAKINT (rc_w1)*/
        CANx->MSTS = CAN_SLEEP_WAITINT;
        break;
    case CAN_INT_EWG:
        /* Clear CAN_MSTS_ERRINT (rc_w1) */
        CANx->MSTS = CAN_ERROR_INT;
        /* Note : the corresponding Flag is cleared by hardware depending
                  of the CAN Bus status*/
        break;
    case CAN_INT_EPV:
        /* Clear CAN_MSTS_ERRINT (rc_w1) */
        CANx->MSTS = CAN_ERROR_INT;
        /* Note : the corresponding Flag is cleared by hardware depending
                  of the CAN Bus status*/
        break;
    case CAN_INT_BOF:
        /* Clear CAN_MSTS_ERRINT (rc_w1) */
        CANx->MSTS = CAN_ERROR_INT;
        /* Note : the corresponding Flag is cleared by hardware depending
                  of the CAN Bus status*/
        break;
    case CAN_INT_LEC:
        /*  Clear LEC bits */
        CANx->ESTS = RESET;
        /* Clear CAN_MSTS_ERRINT (rc_w1) */
        CANx->MSTS = CAN_ERROR_INT;
        break;
    case CAN_INT_ERR:
        /*Clear LEC bits */
        CANx->ESTS = RESET;
        /* Clear CAN_MSTS_ERRINT (rc_w1) */
        CANx->MSTS = CAN_ERROR_INT;
        /* Note : BOFF, EPVF and EWGF Flags are cleared by hardware depending
            of the CAN Bus status*/
        break;
    default:
        break;
    }
}

/**
*\*\name   Interrupt_Status_Check
*\*\fun    Checks whether the CAN interrupt has occurred or not.
*\*\param  CAN_register specifies the CAN interrupt register to check.
*\*\param  interrupt_bit specifies the interrupt source bit to check.
*\*\return INTStatus:
*\*\                    - SET
*\*\                    - RESET
**/
INTStatus Interrupt_Status_Check(uint32_t CAN_register, uint32_t interrupt_bit)
{
    if ((CAN_register & interrupt_bit) != (uint32_t)RESET)
    {
        /* CAN_interrupt is set */
        return SET;
    }
    else
    {
        /* CAN_interrupt is reset */
        return RESET;
    }
}



/**
*\*\name   CAN_Software_Reset
*\*\fun    Enable software reset.
*\*\param  CANx:
*\*\               - CAN
*\*\return none
**/
void CAN_Software_Reset(CAN_Module* CANx)
{
    /* Enable software reset */
    CANx->MCTRL |= CAN_SW_MASTER_RESET;
}


/**
*\*\name   CAN_Transmit_Fail_Status_Get
*\*\fun    Get the status of sending email failure.
*\*\param  CANx:
*\*\               - CAN
*\*\param  mailbox_queue:
*\*\               - CAN_TXSTS_MAILBOX0
*\*\               - CAN_TXSTS_MAILBOX1
*\*\               - CAN_TXSTS_MAILBOX2
*\*\return FlagStatus:
*\*\               - SET
*\*\               - RESET
**/
FlagStatus CAN_Transmit_Fail_Status_Get(CAN_Module* CANx,uint8_t mailbox_queue)
{
    FlagStatus status_value = RESET;
    switch (mailbox_queue)
    {
        case (CAN_TXSTS_MAILBOX0):
            if((CAN->TSTS & CAN_TSTS_TERRM0) == RESET)
            {
                status_value = RESET;
            }
            else
            {
                status_value = SET;
            }
            break;
        case (CAN_TXSTS_MAILBOX1):
            if((CAN->TSTS & CAN_TSTS_TERRM1) == RESET)
            {
                status_value = RESET;
            }
            else
            {
                status_value = SET;
            }
            break;
        case (CAN_TXSTS_MAILBOX2):
            if((CAN->TSTS & CAN_TSTS_TERRM2) == RESET)
            {
                status_value = RESET;
            }
            else
            {
                status_value = SET;
            }
            break;
        default:
            break;
    }
    return status_value;
}

/**
*\*\name   CAN_Arbitration_Lost_Status_Get
*\*\fun    Get the status of arbitration lost.
*\*\param  CANx:
*\*\               - CAN
*\*\param  mailbox_queue:
*\*\               - CAN_TXSTS_MAILBOX0
*\*\               - CAN_TXSTS_MAILBOX1
*\*\               - CAN_TXSTS_MAILBOX2
*\*\return FlagStatus:
*\*\               - SET
*\*\               - RESET
**/
FlagStatus CAN_Arbitration_Lost_Status_Get(CAN_Module* CANx,uint8_t mailbox_queue)
{
    FlagStatus status_value = RESET;
    switch (mailbox_queue)
    {
        case (CAN_TXSTS_MAILBOX0):
            if((CAN->TSTS & CAN_TSTS_ALSTM0) == RESET)
            {
                status_value = RESET;
            }
            else
            {
                status_value = SET;
            }
            break;
        case (CAN_TXSTS_MAILBOX1):
            if((CAN->TSTS & CAN_TSTS_ALSTM1) == RESET)
            {
                status_value = RESET;
            }
            else
            {
                status_value = SET;
            }
            break;
        case (CAN_TXSTS_MAILBOX2):
            if((CAN->TSTS & CAN_TSTS_ALSTM2) == RESET)
            {
                status_value = RESET;
            }
            else
            {
                status_value = SET;
            }
            break;
        default:
            break;
    }
    return status_value;
}


/**
*\*\name   CAN_Flag_Lowest_Priority_Get
*\*\fun    Get the flag of lowest priority.
*\*\param  CANx:
*\*\               - CAN
*\*\param  mailbox_queue:
*\*\               - CAN_TXSTS_MAILBOX0
*\*\               - CAN_TXSTS_MAILBOX1
*\*\               - CAN_TXSTS_MAILBOX2
*\*\return FlagStatus:
*\*\               - SET
*\*\               - RESET
**/
FlagStatus CAN_Flag_Lowest_Priority_Get(CAN_Module* CANx,uint8_t mailbox_queue)
{
    FlagStatus status_value = RESET;
    switch (mailbox_queue)
    {
        case (CAN_TXSTS_MAILBOX0):
            if((CAN->TSTS & CAN_TSTS_LOWM0) == RESET)
            {
                status_value = RESET;
            }
            else
            {
                status_value = SET;
            }
            break;
        case (CAN_TXSTS_MAILBOX1):
            if((CAN->TSTS & CAN_TSTS_LOWM1) == RESET)
            {
                status_value = RESET;
            }
            else
            {
                status_value = SET;
            }
            break;
        case (CAN_TXSTS_MAILBOX2):
            if((CAN->TSTS & CAN_TSTS_LOWM2) == RESET)
            {
                status_value = RESET;
            }
            else
            {
                status_value = SET;
            }
            break;
        default:
            break;
    }
    return status_value;
}


/**
*\*\name   CAN_Flag_Lowest_Priority_Get
*\*\fun    Get the flag of lowest priority.
*\*\param  CANx:
*\*\               - CAN
*\*\param  mailbox_queue:
*\*\               - CAN_TXSTS_MAILBOX0
*\*\               - CAN_TXSTS_MAILBOX1
*\*\               - CAN_TXSTS_MAILBOX2
*\*\return FlagStatus:
*\*\               - SET
*\*\               - RESET
**/
FlagStatus CAN_Flag_Transmit_Mailbox_Empty_Get(CAN_Module* CANx,uint8_t mailbox_queue)
{
    FlagStatus status_value = RESET;
    switch (mailbox_queue)
    {
        case (CAN_TXSTS_MAILBOX0):
            if((CAN->TSTS & CAN_TX_MAILBOX_EMPTY0) == RESET)
            {
                status_value = RESET;
            }
            else
            {
                status_value = SET;
            }
            break;
        case (CAN_TXSTS_MAILBOX1):
            if((CAN->TSTS & CAN_TX_MAILBOX_EMPTY1) == RESET)
            {
                status_value = RESET;
            }
            else
            {
                status_value = SET;
            }
            break;
        case (CAN_TXSTS_MAILBOX2):
            if((CAN->TSTS & CAN_TX_MAILBOX_EMPTY2) == RESET)
            {
                status_value = RESET;
            }
            else
            {
                status_value = SET;
            }
            break;
        default:
            break;
    }
    return status_value;
}


/**
*\*\name   CAN_Receive_Signal_Get
*\*\fun    Returns the CANx's receive signal value (RXS).
*\*\param  CANx:
*\*\            - CAN
*\*\return FlagStatus:
*\*\            - SET
*\*\            - RESET
**/
FlagStatus CAN_Receive_Signal_Get(CAN_Module* CANx)
{    
    if((CANx->MSTS & CAN_RX_SIGNAL) == RESET)
    {
        return RESET;
    }
    else
    {
        return SET;
    }
}


/**
*\*\name   CAN_Last_Sample_Point_Get
*\*\fun    Returns the CANx's Last sample point (LSMP).
*\*\param  CANx:
*\*\            - CAN
*\*\return FlagStatus:
*\*\            - SET
*\*\            - RESET
**/
FlagStatus CAN_Last_Sample_Point_Get(CAN_Module* CANx)
{    
    if((CANx->MSTS & CAN_LAST_SAMPLE_POINT) == RESET)
    {
        return RESET;
    }
    else
    {
        return SET;
    }
}


/**
*\*\name   CAN_Receive_Mode_Get
*\*\fun    Returns the CANx's receive mode (RXMD).
*\*\param  CANx:
*\*\            - CAN
*\*\return FlagStatus:
*\*\            - SET
*\*\            - RESET
**/
FlagStatus CAN_Receive_Mode_Get(CAN_Module* CANx)
{    
    if((CANx->MSTS & CAN_RX_MODE) == RESET)
    {
        return RESET;
    }
    else
    {
        return SET;
    }
}


/**
*\*\name   CAN_Transmit_Mode_Get
*\*\fun    Returns the CANx's transmit mode (TXMD).
*\*\param  CANx:
*\*\            - CAN
*\*\return FlagStatus:
*\*\            - SET
*\*\            - RESET
**/
FlagStatus CAN_Transmit_Mode_Get(CAN_Module* CANx)
{    
    if((CANx->MSTS & CAN_TX_MODE) == RESET)
    {
        return RESET;
    }
    else
    {
        return SET;
    }
}



/**
*\*\name   CAN_Mailbox_Code_Get
*\*\fun    Returns the CANx's mailbox code (CODE[1:0]).
*\*\param  CANx:
*\*\            - CAN
*\*\return  mailbox_queue :
*\*\            - CAN_TXSTS_MAILBOX0
*\*\            - CAN_TXSTS_MAILBOX1
*\*\            - CAN_TXSTS_MAILBOX2
*\*\            - CAN_TXSTS_NOMAILBOX
**/
uint8_t CAN_Mailbox_Code_Get(CAN_Module* CANx)
{
    uint8_t mailbox_queue = CAN_TXSTS_MAILBOX0;    
    if((CANx->TSTS & CAN_TX_MAILBOX_CODE) == CAN_TXSTS_MAILBOX0)
    {
        mailbox_queue = CAN_TXSTS_MAILBOX0;
    }
    else if((CANx->TSTS & CAN_TX_MAILBOX_CODE) == CAN_TX_MAILBOX_0)
    {
        mailbox_queue = CAN_TXSTS_MAILBOX1;
    }
    else if((CANx->TSTS & CAN_TX_MAILBOX_CODE) == CAN_TX_MAILBOX_1)
    {
        mailbox_queue = CAN_TXSTS_MAILBOX2;
    }
    else
    {
        mailbox_queue = CAN_TXSTS_NOMAILBOX;
    }
    
    return mailbox_queue;
}



